RhinoInside.Revit API Documentation
RenderMaterialConverter.ToRenderMaterial Method
 Converts the specified Material to an equivalent Rhino RenderMaterial.
 Namespace: RhinoInside.Revit.Convert.Render
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8018
Syntax
public static RenderMaterial ToRenderMaterial(
	this Autodesk.Revit.DB.Material material,
	RhinoDoc rhinoDoc
)
Parameters
material
Type: Autodesk.Revit.DB.Material
The material to convert.
rhinoDoc
Type: RhinoDoc
The document to associate the resulting material with.
Return Value
Type: RenderMaterial
A Rhino RenderMaterial that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.Material. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
RenderMaterialConverter Class
RhinoInside.Revit.Convert.Render Namespace